In [75]:
d1={
    "Person":["abc","def","ghi","jkl","abc"],
    "Company":["Incomm","TCS","Infosys","Tech Mahindra","TCS"],
    "Salary":[80,35,42,30,50]
}

In [73]:
import pandas as p
import numpy as n

In [76]:
df=p.DataFrame(d1)
df

  Person        Company  Salary
0    abc         Incomm      80
1    def            TCS      35
2    ghi        Infosys      42
3    jkl  Tech Mahindra      30
4    abc            TCS      50

In [84]:
df_groupby=df.groupby("Person")

In [85]:
for i in df_groupby:
    print(i)

('abc',   Person Company  Salary
0    abc  Incomm      80
4    abc     TCS      50)
('def',   Person Company  Salary
1    def     TCS      35)
('ghi',   Person  Company  Salary
2    ghi  Infosys      42)
('jkl',   Person        Company  Salary
3    jkl  Tech Mahindra      30)

In [70]:
df_groupby=df.groupby("Company").groups
for i in df_groupby:
    print(i)

Incomm
Infosys
TCS
Tech Mahindra

In [80]:
df_groupby=df.groupby("Salary")  ### Without (.groups) whole data is printed
for i,j in df_groupby:
    print(i)
    print(j)

30
  Person        Company  Salary
3    jkl  Tech Mahindra      30
35
  Person Company  Salary
1    def     TCS      35
42
  Person  Company  Salary
2    ghi  Infosys      42
50
  Person Company  Salary
4    abc     TCS      50
80
  Person Company  Salary
0    abc  Incomm      80

In [86]:
df_groupby.agg([n.sum,n.mean])

       Salary
          sum mean
Person
abc       130   65
def        35   35
ghi        42   42
jkl        30   30